#+title: Org Autoexport
#+author: Glenn Hutchings
#+email: zondo42@gmail.com

#+options: author:nil num:nil toc:t tags:nil
#+startup: show3levels

#+property: header-args+ :eval no-export :exports both :noweb yes

#+auto_tangle: t
#+auto_export: gfm
#+auto_export: html

* Implementation

Each of the =#+auto_export:= statements declares an org export /backend/ that
does the export.  With that in mind, here's an outline of the export
algorithm:

1. Get the export backend names from the =#+auto_export:= statements in the
   current file.

2. For each backend, do this:

   - Find the suffix of the file to export to.  For most backends, that's
     just the name of the backend.  But there are special cases: for
     [[https://github.github.com/gfm/][github-flavoured markdown]] the backend is ~'gfm~ but the suffix is =md=.

   - Create the export filename by concatenating the current file's prefix
     with the export suffix.

   - Get the export backend object from its string representation.

   - If the backend is found, do the export.  Otherwise, warn the user.

3. Er... that's it.

Here's a function to get the backend names, using ~org-collect-keywords~:

#+name: get-backends
#+begin_src elisp :results verbatim :results silent
  (defun org-autoexport-get-backends ()
    "Get a list of backend names to auto-export from the current file.

  This is the list of backend names declared by #+auto_export:
  keywords in the org file."
    (delete "AUTO_EXPORT" (car (org-collect-keywords '("AUTO_EXPORT")))))
#+end_src

We can test that on the current file:

#+name: test-backends
#+begin_src elisp :results verbatim
  (org-autoexport-get-backends)
#+end_src

#+RESULTS: test-backends
: ("gfm" "html")

To map the backend names to the right suffix, we'll use an alist which
lists the special cases:

#+name: suffix-map
#+begin_src elisp :results silent
  (defconst org-autoexport-backend-suffix-map
    '(("gfm" . "md")
      ("latex" . "tex"))
    "Mapping of export backend name to file suffix.

  Most of the time, the name and suffix are the same.  This
  variable lists the special cases where they are different.")
#+end_src

And a function which uses this, defaulting to the backend name:

#+name: get-suffix
#+begin_src elisp :results silent
  (defun org-autoexport-get-suffix (backend-name)
    "Return the file suffix used to autoexport using BACKEND-NAME.

  Default is the name of the backend itself, unless a special case
  is found in `org-autoexport-backend-suffix-map'."
    (alist-get backend-name org-autoexport-backend-suffix-map backend-name nil 'equal))
#+end_src

Let's test it:

#+name: test-suffixes
#+begin_src elisp
  (let (suffix (result ""))
    (dolist (backend-name (org-autoexport-get-backends) result)
      (setq suffix (org-autoexport-get-suffix backend-name))
      (setq result (concat result (format "Backend '%s' -> '%s'\n" backend-name suffix)))))
#+end_src

The value of =result= is:

#+RESULTS: test-suffixes
: Backend 'gfm' -> 'md'
: Backend 'html' -> 'html'

Next we need a function to look up the backend object given its name,
defaulting to =nil= if not found:

#+name: get-backend
#+begin_src elisp :results silent
  (defun org-autoexport-get-backend (backend-name)
    "Return the export backend used to autoexport using BACKEND-NAME."
    (org-export-get-backend (intern backend-name)))
#+end_src

Does it work?

#+name: test-lookup
#+begin_src elisp
  (let ((result "") result)
    (dolist (name '("gfm" "html" "md" "latex" "docx") result)
      (cond ((org-autoexport-get-backend name)
             (setq result "found"))
            (t
             (setq result "not found")))
      (setq result (concat result (format "Backend '%s' %s\n" name result)))))
#+end_src

The value of =result= is:

#+RESULTS: test-lookup
: not foundBackend 'docx' not found

Here's the function which puts it all together, and does the exporting:

#+name: do-export
#+begin_src elisp :results silent
  (defun org-autoexport-do-export ()
    "Export the current org file to one or more backends if required.

  The backends are listed in the #+auto_export: directives.  If a backend
  is unknown, a warning is written to the *Warnings* buffer."

    (let (backend suffix filename)
      (unless (buffer-file-name)
        (error "Buffer has no associated filename"))
      (dolist (backend-name (org-autoexport-get-backends))
        (setq suffix (org-autoexport-get-suffix backend-name))
        (setq backend (org-autoexport-get-backend backend-name))
        (setq filename (concat (file-name-base (buffer-file-name)) "." suffix))
        (cond (backend
               (org-export-to-file backend filename))
              (t
               (warn "No export backend for '%s'" backend-name))))))
#+end_src

Next we need a minor autoexport mode, which (if enabled) does the
exporting.  The idea here is to have this turned on in ~org-mode-hook~.

#+name: autoexport-mode
#+begin_src elisp :results silent
  (define-minor-mode org-autoexport-mode
    "Automatically export Org mode files with #+auto_export options."
    :lighter " Exp"

    (if org-autoexport-mode
        (add-hook 'after-save-hook #'org-autoexport-do-export nil 'local)
      (remove-hook 'after-save-hook #'org-autoexport-do-export 'local)))
#+end_src

And that's it.  If you're looking at the org mode source of this file,
you'll see that the source code is tangled directly from it.

